# Определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра


def buns():  # булочка
    print(ingredients_1)


def cutlets():  # котлета
    print(ingredients_2, 'и добавляем ', ingredients_7)


def mustard():  # горчица
    print('добавляем', ingredients_3, 'по вкусу')


def a_pickle():  # огурец
    print('добавляем', ingredients_5)


def tomato():  # помидоры
    print(ingredients_8)


def mayonnaise():  # майонез
    print(ingredients_9)


def cheese():  # сыр
    print('выгладываем', ingredients_6)


def ketchup():  # кетчуп
    print(ingredients_10)


def onion():  # лук
    print(ingredients_4)


ingredients_1 = 'берем булочку для гамбургеров, поджаренную в тостере'
ingredients_2 = 'готовим на гриле рубленный бифштекс из говядины'
ingredients_3 = 'горчичный соус'
ingredients_4 = 'лук репчатый свежий резаный'
ingredients_5 = 'огурцы маринованные резанные'
ingredients_6 = 'плавленый сыр Чеддер'
ingredients_7 = 'приправу для гриля'
ingredients_8 = 'выкладываем нарезаные колечками помидоры'
ingredients_9 = 'добавляем майонез по вкусу'
ingredients_10 = 'добавляем кетчуп по вкусу'
